Revit 2026 API

# GeometryCreationUtilities Class

---

A utility that allows construction of basic solid shapes.

SystemObject Autodesk.Revit.DBGeometryCreationUtilities

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class GeometryCreationUtilities
```
```vb
Public NotInheritable Class GeometryCreationUtilities
```
```cpp
public ref class GeometryCreationUtilities abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type GeometryCreationUtilities = class end
```

The GeometryCreationUtilities type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CreateBlendGeometry(CurveLoop, CurveLoop, ICollectionVertexPair) |  |
|  | CreateBlendGeometry(CurveLoop, CurveLoop, ICollectionVertexPair, SolidOptions) |  |
|  | CreateExtrusionGeometry(IListCurveLoop, XYZ, Double) |  |
|  | CreateExtrusionGeometry(IListCurveLoop, XYZ, Double, SolidOptions) |  |
|  | CreateFixedReferenceSweptGeometry(CurveLoop, Int32, Double, IListCurveLoop, XYZ) |  |
|  | CreateFixedReferenceSweptGeometry(CurveLoop, Int32, Double, IListCurveLoop, XYZ, SolidOptions) |  |
|  | CreateLoftGeometry |  |
|  | CreateRevolvedGeometry(Frame, IListCurveLoop, Double, Double) |  |
|  | CreateRevolvedGeometry(Frame, IListCurveLoop, Double, Double, SolidOptions) |  |
|  | CreateSweptBlendGeometry(Curve, IListDouble, IListCurveLoop, IListICollectionVertexPair) |  |
|  | CreateSweptBlendGeometry(Curve, IListDouble, IListCurveLoop, IListICollectionVertexPair, SolidOptions) |  |
|  | CreateSweptGeometry(CurveLoop, Int32, Double, IListCurveLoop) |  |
|  | CreateSweptGeometry(CurveLoop, Int32, Double, IListCurveLoop, SolidOptions) |  |

The shapes created by these utilities are not a part of any Revit document, but can be used in conjunction with other geometric utilities from within API applications.

#### Reference

Autodesk.Revit.DB Namespace